import React from 'react';

const Buddhism = () => {
    return (
        <div className={"religionComponent"}>
            <div className={"contentText"}>
                <h1>Буддизм</h1>
                <h6>
                    Будди́зм — релігійно-філософське вчення (дхарма) про духовне пробудження (бодгі), яке виникло
                    близько VI століття до н. е. в Стародавній Індії. Засновником вчення вважається Сіддхартха Гаутама,
                    який
                    надалі отримав ім'я Будда Шак'ямуні. Оригінальна назва вчення — дгарма (закон, вчення) або
                    будда-дгарма
                    (вчення Будди). Слово «буддизм» створене європейцями у XIX столітті.
                </h6>
                <h6>
                    Будди́зм — одна зі світових релігій, яка зародилася в Індії і поширилася переважно в Азії: від
                    Шрі-Ланки до Бурятії, і від Калмикії до Японії. Найбільше послідовників має в країнах
                    Південно-Східної Азії, Східній Азії та Тибеті. «Без розуміння буддизму неможливо зрозуміти і великі
                    культури Сходу — індійську, китайську, не говорячи вже про культури Тибету та Монголії, які
                    пронизані
                    духом буддизму до самих основ». Однак, послідовники буддизму зустрічаються в усьому світі, зокрема в
                    Україні.
                </h6>
                <h6>
                    Буддизм є предметом вивчення буддології. Хоча буддизм вважається релігією і має багато ознак
                    релігії,
                    як-от храми, чернецтво, молитви, у ньому немає віри в Бога-творця, тому його нерідко називають
                    «атеїстичною» релігією.
                </h6>
                <h3>Історія буддизму</h3>
                <h4>Виникнення</h4>
                <h6>Буддизм виник на північному сході Індії, на території держав Маґадга, Кошала і Вайшалі, де
                    проповідував історичний будда Сіддгартха Ґаутама. Час появи цієї релігії пов'язується із датою
                    смерті Ґаутами, яких в буддистській традиції існує дві — 544 до н. е. і 486 до н. е.. Перша дата
                    була прийнята ЮНЕСКО як дата заснування буддизму. Проте вона заперечується буддологами, які
                    вважають, що будда помер близько 400 до н. е., до походів Александра Македонського в Індію.
                    Відповідно, появу буддизму слід датувати початком 4 століття до н. е., серединою «осьового часу».
                </h6>
                <h6>
                    Причиною виникнення буддизму називають кризу традиційного ведичного брахманізму в середині 1
                    тисячоліття до н. е.. Місце зародження буддизму — північно-східна Індія — була форпостом
                    альтернативних релігійно-філософських рухів, які підтримувалися станом воїнів-кшатріїв для боротьби
                    за владу із жерцями-брахманами. Відповідно, соціальною опорою буддизму в Індії стали воїни, а
                    точніше їхні лідери — правителі раджі. Сам Будда Ґаутама також походив зі стану воїнів.
                </h6>
                <h4>Вплив на політичні вчення Стародавньої Індії</h4>
                <h6>Офіційна наука брахманів — брахманізм — зустріла реакцію в новій релігії буддизмі. Нові релігії
                    поширилися серед нижчих класів, бо не визнавали суспільної нерівності й навіть паріїв приймали за
                    своїх визнавців. Але вищі верстви залишилися при вигідному положенні.
                </h6>
                <h6>
                    Традиційно-теологічному брахманістичному тлумаченню дгарми буддизм протиставив свій, в багатьох
                    випадках раціоналістичний підхід до розуміння тодішньої політико-правової думки та ідеології в
                    цілому. Трактування дгарми, як і все світосприйняття раннього буддизму, пронизане проповіддю
                    гуманізму, добрих відносин між людьми, любові до ближнього, ненасильства. Для буддизму притаманна
                    тенденція до зменшення ролі і масштабів покарань. Саме вчення вихваляє законність і законний шлях в
                    житті. Для того, щоб виконувати ці закони, людина повинна знаходитись на певному рівні розвитку.
                </h6>
                <h4>Період розквіту в Індії та поширення в інших краях</h4>
                <h6>З ростом числа її поборників зміцнювались їхні позиції в суспільно-політичному житті. Згодом ідеї
                    буддизму почали сильніше впливати на державну політику і законодавство. Під час правління Ашоки
                    (268—232 рр. до н. е.), який об‘єднав Індію, буддизм був визнаний державною релігією. Пізніше вплив
                    релігії розповсюдився на інші країни Південно-Східної Азії. До I-го століття нової ери були записані
                    й кодифіковані священні тексти буддизму, зібрані в три «кошики». Це зібрання отримало назву
                    Трипітака. Проте, одночасно з поширенням вчення почало дробитися — виникли численні школи.
                </h6>
                <h6>
                    Десь на початку I-го тисячоліття буддизм проник у Китай, а десь з VII-го століття — в Корею та
                    Японію. У нових краях виникали свої власні школи. У самій Індії в період Імперії Гуптів буддизм став
                    занепадати, Із завоюванням Індії мусульманами буддизм у ній занепав зовсім, поступившись частково
                    ісламу, а частково індуїзму.
                </h6>
                <h6>
                    У Європі серйозний інтерес до буддизму виник у XIX столітті, спочатку в інтелектуальних колах. У XX
                    столітті, з еміграцією на захід значного числа китайців та представників інших народів, що
                    сповідували буддизм, ця релігія стала справді всесвітньою.
                </h6>
            </div>
            <div className={"contentImages"}>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Dharma_Wheel.svg/180px-Dharma_Wheel.svg.png"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Kamakura_Budda_Daibutsu_front_1885.jpg/220px-Kamakura_Budda_Daibutsu_front_1885.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Buddha123.jpg/220px-Buddha123.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Buddha_in_Haw_Phra_Kaew.jpg/170px-Buddha_in_Haw_Phra_Kaew.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Buddha-Footprint.jpeg/170px-Buddha-Footprint.jpeg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Japanese_buddhist_monk_by_Arashiyama_cut.jpg/300px-Japanese_buddhist_monk_by_Arashiyama_cut.jpg"}/>
            </div>
        </div>
    );
};

export default Buddhism;