import React from 'react';

const Christianity = () => {
    return (
        <div className={"religionComponent"}>
            <div className={"contentText"}>
                <h1>Християнство</h1>
                <h6>
                    Христия́нство (від грец. Χριστός — «Месія») — один із напрямів єдинобожжя. Поряд з ісламом та
                    буддизмом входить до числа трьох світових релігій. Характерною рисою християнства, яка вирізняє його
                    серед інших напрямів єдинобожжя, є віра в Ісуса Христа як втілення і прояв Бога заради спасіння
                    всього людства і людського суспільства і настанови в істині. На відміну від християнства, іслам та
                    юдаїзм не визнають Ісуса Христа як одну з іпостасей Всевишнього. Одна з авраамічних релігій
                    (семітського походження, також юдаїзм, іслам).
                </h6>
                <h6>
                    Хрест — символ християнства
                    Християнство зародилося на сході Римської імперії (території сучасного Ізраїлю, в Палестині) у I
                    столітті. Християнська церква, як фактично єдина географічно-адміністративна спільнота, проіснувала
                    приблизно до 484 року, хоча з кінця I століття в ній виникали різні секти, протистояння. Остаточний
                    розкол Християнської Церкви на Східну (Православ'я) та Західну (Католицизм) відбувся 1054 року, у
                    1517 р. виник Протестантизм — 3 основне розгалуження в християнстві.
                </h6>
                <h6>
                    В наш час християнство — найпоширеніша у світі релігія, — його дотримуються близько 2,2 млрд осіб,
                    що становить понад 1/3 людства. Християнство посідає 1-ше місце у світі за географічним поширенням,
                    тобто майже в кожній країні світу є хоча б одна християнська громада.
                </h6>
                <h3>Передумови та джерела християнства</h3>
                <h6>Релігійним джерелом християнства була юдейська сектантська течія Ессеї — тобто широкий рух,
                    опозиційний панівному юдаїзмові, чию головну течію нарекли як Фарисеї. Ессеї поділяли юдейську віру
                    в єдиного Бога, що опікував народ Ізраїлю. Більше того, саме себе вони вважали представниками
                    справжнього юдаїзму, покликаного оновити старий союз (заповіт) між Богом і народами Ізраїлю.

                    Ідеології юдейського сектантства Ессеїв були властиві дві основні риси:
                    <br/>
                    <br/>
                    - есхатологізм (грец. єсхатос, — кінець) — вчення про «кінець світу» і його подальше відновлення
                    разом
                    з останнім Судом над усіма, що коли-небудь жили;<br/>
                    - месіанство (месія — від давньогебрейського машиах, букв. Помазаник, Посланник Божий) — віра в
                    божественного Спасителя, що здійснить цей переворот, відтак поверне юдеям Божу прихильність.
                </h6>
                <h3>Історія християнства</h3>
                <h4>Виникнення раннього християнства</h4>
                <h6>Виникнення християнства взято за основу сучасного літочислення, нової ери в історії людства, яка
                    почалася понад 2000 років тому. Християнство зародилось в I столітті на Близькому Сході, на
                    юдейських землях (провінція Юдея) Римської імперії, серед месіанських рухів тодішнього єврейського
                    єдинобожжя. Корені християнського віровчення пов'язані з дохристиянським єдинобожжям стародавніх
                    євреїв та вченням Старого Завіту (Закон, Пророки і Писання — Танах).</h6>
                <h6>
                    Згідно Біблією, а також інших джерел того часу, перші спільноти християн (коло віруючих,
                    християнська Церква) виникли в I столітті у східних провінціях Римської імперії в Палестині, місці
                    народження Христа, Святій Землі унаслідок проповіді учнів Христа, святих апостолів та їх
                    послідовників. Християнство від початку поширилось у переважно грекомовній східній частині Римської
                    імперії. Св. Павло та апостоли активно подорожували по всій Імперії, засновуючи Церкви у основних
                    містах. Перші Церкви з'явились в Антиохії, Александрії та Єрусалимі, а потім у двох політичних
                    центрах — у Римі і Константинополі.
                </h6>
                <h6>
                    Общини первісного християнства складалися з бідних людей, у цьому розумінні первісне християнство
                    було релігією пригноблених. Церкви, — у сучасному розумінні як окремої будівлі для збирання членів
                    общин — не було. Збиралися або в приватних приміщеннях, або, при переслідуванні з боку римської
                    влади, у печерах чи катакомбах</h6>
                <h4>Нікейський собор</h4>
                <h6>Тривалі гоніння християн припинились у 313 році, коли імператор Костянтин Великий оприлюднив
                    Міланський указ (едикт). За його правління (306—337 рр.) християнська релігія перетворилася на
                    державну, вона користувалася економічною, політичною та ідеологічною підтримкою держави.
                    Відбувається подальша централізація церкви: єпископії та митрополії об'єднались у патріархії на чолі
                    з патріархом. У першій половині IV ст. на території імперії були три патріархії — римська,
                    олександрійська та антіохійська. Наприкінці IV ст. — єрусалимська.
                </h6>
                <h6>
                    Протягом IV—VIII ст. доктрина, культ і правові засади християнства оформлювались на «Вселенських
                    соборах», серед яких — Перший Нікейський, Перший Константинопольський (381), Ефеський (431),
                    Халкедонський (451), Другий Константинопольський (553), Третій Константинопольський (680—681) і
                    Другий Нікейський (787).
                </h6>
                <h6>
                    Складний процес формування доктрини супроводжувався розколами церкви та виокремленнями доктринальних
                    течій, що оголошувалися на Вселенських соборах єресями і засуджувалися. Становлення християнської
                    доктрини проходило у полеміці з іншими релігійними течіями: юдаїзмом, гностицизмом, докетизмом,
                    маніхейством та іншими. Було визнано хибними неортодоксальні погляди на Святу Трійцю такі як
                    аріанство, несторіанство, монофізитство, монофелітство тощо.</h6>
                <h4>Розкол християнської церкви</h4>
                <h6>
                    Християнство почало поступово приймати елементи елліністичної та римської культури, що спричинило до
                    численних конфліктів всередині Церкви. З християнським приматом Риму не погоджувалося багато
                    єпископів Сходу та східноримських імператорів, що вперше яскраво проявився на Трулльському соборі
                    (692). Розбіжності стали поглиблюватися за часів патріарха Фотія, що оголосив єретичним формулювання
                    «філіокве» і остаточно були розв'язані Розколом християнської церкви 1054 року, що розділив
                    християнську церкву на дві основні течії — католицизм і православ'я, а сам термін «католицький»
                    почав стосуватися лише західної гілки християнства. Остаточно поділ Церков завершився після
                    захоплення в 1204 році Константинополя хрестоносцями. Хрестоносці взяли місто, розграбували його і
                    утворили в Константинополі Латинську імперію, що проіснувала понад 50 років. З того часу православна
                    й католицька церкви продовжували жити й розвиватися окремо одна від одної.
                </h6>
                <h6>
                    Реформація в Європі: поширення протестантизму
                    В наступні століття неодноразово здійснювались спроби подолати християнський розкол, зокрема на
                    Ліонському (1274) та Флорентійському (1438) соборах, проте ці спроби щоразу зазнавали невдачі.
                    Натомість у XVI столітті католицизм зазнав чергової хвилі розколу, викликаної Реформацією — рухом за
                    оновлення християнства. Реформація стала реакцією на ряд негативних явищ, що мали місце в
                    католицькій церкві у попередні століття і призвела до виділення нових гілок християнства, зазвичай
                    окреслюваних збірним терміном протестантизм — лютеранство (Мартін Лютер, 1517), англіканство (король
                    Генріх VIII, 1534) і кальвінізм (Жан Кальвін, 1536), що поширилися головним чином у Німеччині,
                    Англії, Нідерландах і Скандинавських країнах.
                </h6>
                <h6>
                    З географічними відкриттями XVI—XVII століття Католицька церква розпочала активну місіонерську
                    діяльність у країнах Нового світу і в Азії. Поширення католицизму відбувалося також шляхом укладання
                    уній між Римо-католицькою церквою з православними спільнотами, найбільш значимою з яких була
                    Берестейська унія (1596), внаслідок якої повстала Українська греко-католицька церква.
                </h6>
                <h4>Сучасний стан</h4>
                <h6>Загалом близько 2,2 млрд людей із 238 країн світу або 33,4 % земного населення вважають себе
                    християнами[2] На сьогоднішній день в християнській церкві, як спільноті виділяють 3 основних течії:
                    Католицизм (понад 50 % від усіх християн), Протестантизм (близько чверті від усіх християн),
                    Православ'я (близько 12 %), та низку дрібніших.
                </h6>
                <h6>
                    У XX столітті почався рух за зближення християнських церков, що отримав назву екуменізм. Одним з
                    перших екуменічних зібрань вважається міжконфесійна протестантська місіонерська конференція 1910
                    року в Единбурзі. Формування екуменічного руху в сучасному вигляді було закладено на
                    протестантсько-православних конференціях 1920 року в Женеві, 1927 року в Лозанні і довершено
                    конференцією 1945 року в Стокгольмі, а також створенням в 1948 році Всесвітньої ради церков[3].
                    Переломним в історії православно-католицьких відносин став 1965 рік, коли Патріарх
                    Константинопольський Афінагор I і Папа Римський Павло VI скасували взаємні анафеми, накладені 1054
                    року.
                </h6>
                <h6>
                    Віра в Бога серед жителів Європейського Союзу та Туреччини. Результати опитування організації
                    Євробарометр у 2005 р.
                    Є також чисельна група людей, які звуть себе християнами лише формально, без будь-якої глибокої віри
                    в християнські догмати чи майбутню есхатологію, не беруть участі у видимому поклонінні Христу,
                    трактуючи християнство скоріш, як традицію, в якій вони народились, і до якої вони формально
                    належать. Загалом рівень віри та релігійного поклоніння серед тих хто приписує себе до християнської
                    традиції суттєво коливається в залежності від переконань та знань особи, а також впливу суспільного
                    середовища. В останні століття, в часи поширення матеріалістичного світогляду багато людей покидають
                    церкву і займають позиції агностицизму або відвертого атеїзму. Останні десятиліття позначились також
                    небувалим поширенням єресей та сект в християнстві, головне в лоні протестантизму. Тим не менше
                    християнство залишається домінуючою світовою релігією, а на пострадянських теренах спостерігається
                    видиме відродження ортодоксального східного християнства після 70-літнього переслідування та
                    скасування заборон його практикування атеїстичним комуністичним режимом.
                </h6>
            </div>
            <div className={"contentImages"}>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Christian_cross.svg/200px-Christian_cross.svg.png"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Trinidad_El_Greco2.jpg/200px-Trinidad_El_Greco2.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/CompositeJesus.JPG/200px-CompositeJesus.JPG"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Bernhard_Plockhorst_-_Good_Shephard.jpg/200px-Bernhard_Plockhorst_-_Good_Shephard.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Retable_de_l%27Agneau_mystique_%2810%29.jpg/200px-Retable_de_l%27Agneau_mystique_%2810%29.jpg"}/>
            </div>
        </div>
    );
};

export default Christianity;