import React from 'react';

const Deism = () => {
    return (
        <div className={"religionComponent"}>
            <div className={"contentText"}>
                <h1>Деїзм</h1>
                <h6>
                    Деї́зм (від лат. deus, «бог») — віра в Бога-творця світу, але невіра в його подальшу діяльність у
                    цьому світі (тобто, надалі він не втручається — на противагу теїзму).
                </h6>
                <h6>
                    Деїзм пов'язаний з визнанням Бога-творця, поняттям, яке акумулює в собі ідею креаціонізму. Ця ідея
                    заснована на відчуженні, абсолютизації та обожненні могутньої творчої активності людини. В
                    ідеалістичній формі вона ввела у філософію незнаного в часи античності суб'єкта, який творить і
                    пізнає світ.
                </h6>
                <h6>
                    З розвитком ремесел і промисловості ставлення людини до світу й природи взагалі все частіше стає не
                    тільки пізнавальним, а й практично-перетворювальним, виникає потреба у зведенні божественної
                    творчості до її земної основи, в розкритті творчих сутнісних сил самої людини. Це зведення було
                    тривалим історико-філософським процесом, одним зі щаблів якого був деїзм. Якщо пантеїзм повертав
                    активність природі й людині, розчиняючи в них Бога, то деїзм, обмежуючи Бога роллю творця світу,
                    першопричини, гаранта незмінності природи, надавав у такий спосіб відносну самостійність вторинним
                    причинам і, отже, хоча б частково, повертав активність і самостійність природі, матерії, людині.
                </h6>
                <h6>
                    Родоначальником деїзму вважається лорд Едвард Герберт Чербері (1583—1648). Найбільшого розквіту
                    деїзм досяг в епоху Просвітництва. Великий внесок у розповсюдження деїзму вніс орден ілюмінатів.
                    Одним з найвідоміших прихильників деїзму вважається Марі Франсуа Аруе, який більше відомий як
                    Вольтер. Переконання письменника та філософа помітні у кількох його творах.
                </h6>
                <h3>ДЕ ЗАРОДИВСЯ ДЕЇЗМ?</h3>
                <h6>Батьківщиною деїзму була Англія, потім вчення стало популярним у Франції і в Німеччині. У кожній з
                    країн напрямок мало свою характерну забарвлення, що поєднується з ментальністю людей. Саме ці три
                    країни були центрами ідеології Просвітництва, більшість наукових відкриттів відбулися саме в них.
                </h6>
                <h6>
                    В Англії деїзм ні повсюдно поширений серед освічених людей. Лише вузький прошарок письменників і
                    філософів на чолі з лордом Чербері «засвітилася» новою ідеєю. Вони писали численні праці, спираючись
                    на ідеї античних філософів. Засновник деїзму різко критикував церкву: він вважав, що вона володіє
                    безмежною владою, заснованої на сліпій вірі людей.</h6>
                <h6>
                    Друга назва деїзму - це релігія розуму, описана в «Трактаті про істину», праці Чербері. Пік
                    популярності напрямки в Англії припав на першу половину 18-го століття: ідеї вчення стали розділяти
                    навіть глибоко віруючі люди.</h6>
                <h6>Велике значення мав деїзм для Франції: Вольтер, Мелье і Монтеск'є жорстко критикували владу церкви.
                    Вони протестували не проти віри в Бога, а проти нав'язуваних релігією заборон і обмежень, а також
                    проти великої влади церковних службовців.
                </h6>
                <h6>
                    Вольтер - це ключова фігура у французькій Освіті. Вчений з християнина перетворюється в деїсти. Він
                    визнає раціональну віру, а не сліпу.
                </h6>
                <h6>
                    Деїсти Німеччини читали праці своїх англійських і французьких сучасників. Далі вони утворили
                    популярне рух "Просвіта". Німецький філософ Вольф був деистом: завдяки йому протестанская релігія
                    стала більш вільною.</h6>
            </div>
            <div className={"contentImages"}>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/0/0d/Deism_symbol.png"}/>
                <img
                    src={"https://www.phildic.ru/wp-content/uploads/deiam.jpg"}/>
                <img
                    src={"https://thumbs.dreamstime.com/b/%D1%83%D1%87%D0%B8%D1%81%D1%8C-%D0%B8%D0%B7%D1%83%D1%87%D0%B0%D0%B9-%D0%B8-%D0%BF%D1%80%D0%BE%D0%B2%D0%B5%D1%80%D1%8F%D0%B9-%D0%B4%D0%B5%D0%B8%D0%B7%D0%BC-%D0%B8%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B0%D0%B5%D0%BC%D1%8B%D0%B9-%D0%BA%D0%B0%D0%BA-%D1%83%D0%B2%D0%B5%D0%BB%D0%B8%D1%87%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D0%B5-%D1%81%D1%82%D0%B5%D0%BA%D0%BB%D0%BE-164571786.jpg"}/>
            </div>
        </div>
    );
};

export default Deism;