import React from 'react';

const Islam = () => {
    return (
        <div className={"religionComponent"}>
            <div className={"contentText"}>
                <h1>Іслам</h1>
                <h6>
                    Ісла́м (араб. الإسلام, буквально означає смирення, сумирність, упокорення Єдиному Богу і Його волі)
                    — одна з найпоширеніших світових релігій, що сформувалася у 7-му столітті в Аравії. Засновником
                    вважається пророк Магомет (570—632 рр.).
                </h6>
                <h6>
                    Іслам характеризують як монотеїстичну релігію, що має авраамічне коріння. Прихильників ісламу
                    називають мусульманами. Наразі, загальна кількість вірян цієї релігії в світі коливається в межах
                    від 1,1–1,8 мільярдів, що робить іслам другою за чисельністю релігією після християнства.
                </h6>
                <h6>
                    Мусульмани складають переважну більшість населення багатьох країн Азії й Африки. Характерною ознакою
                    ісламу є його роль як соціального і культурного регулятора. У мусульманській громаді всі сторони
                    життя людини і суспільства регламентовані релігією.
                </h6>
                <h3>Історія</h3>
                <h4>Доісламські часи</h4>
                <h6>Територія Аравійського півострова у доісламські часи була в основному язичницькою. Семітські
                    політеїстичні вірування були переважаючими серед місцевого населення, особливо кочового. Серед
                    тогочасного суспільства переважали сильні родинно-племінні зв'язки та патріархат.
                </h6>
                <h6>
                    Ісламська святиня Кааба у ці часи була капищем язичницьких ідолів, в якому кожне плем'я тримало
                    свого (або своїх) ідолів. Всього їх було близько 360. На стінах Кааби також були фрески й ікони
                    Авраама, Діви Марії та Ісуса. Ідолам «Лат», «Узза» й «Манат», які вважалися божествами курайшитів,
                    вклонялися більше за інших. «Лат» вважали богинею — матір'ю всіх богів і була вона створена з білого
                    каменю. Її храм був у місті Таїфа. «Маната» вважали божеством долі й смерті. Його храм був між
                    Меккою та Мединою.
                </h6>
                <h6>
                    Окрім цих ідолів, кожна сім'я вклонялася ще окремим речам, таким як різні символи Місяця, Сонця,
                    дерев тощо. Ці люди приносили жертви своїм ідолам і щорічно призначали одну людину зі свого племені,
                    зарізали його й дарували своїм богам, після чого його тіло ховали поруч із Каабою.
                </h6>
                <h6>
                    Таким чином, багатобожжя було найпоширенішою вірою в Хіджазі (Північ Аравії), і лише незначна
                    кількість євреїв, котрі мешкали в Ясрібі й Хейбарі, а також християни, які жили на півночі Хіджазу,
                    вірили в єдиного Бога. Мусульмани вважають, що пророк Авраам вперше закликав арабів Хіджазу до
                    поклоніння єдиному Богу, і відтоді дуже мало людей, яких називали ханіфітами, теж вірили в Бога й
                    Авраама як його пророка. Вважається, що тоді Авраам здійснив священний обряд на честь Кааби, котрий
                    потім продовжував виконуватися, а після ісламу дещо змінився. Цей обряд і досі щорічно виконують
                    мусульмани.</h6>
                <h4>Зародження та становлення ісламу</h4>
                <h6>
                    Іслам як релігія сформувався у VII столітті на Аравійському півострові, що пов'язано з життям і
                    діяльністю пророка Магомета, який вважається посланцем Всевишнього, Його пророком, через якого людям
                    було передано текст Корану (з араб. «аль-кур'ан» — «читання»).
                </h6>
                <h6>
                    Ідейні розбіжності серед мусульман призвели до того, що вже в середині 8 ст. в ісламі утворилось не
                    менше п'яти основних релігійно-політичних угруповань. Це — харіджити, шиїти, мурджиїти, мутазиліти
                    та суніти. Кожне з угруповань відстоювало своє вчення як єдино вірне, звинувачуючи своїх
                    супротивників у відході від істинної віри. Проблема правовірності стала однією з центральних проблем
                    мусульманського богослов'я.
                </h6>
                <h4>Поширення</h4>
                <h6>
                    Іслам — панівна релігія на Близькому Сході, у деяких місцевостях Африки й Азії. Велика ісламська
                    громада є на Балканському півострові та у Росії. Є також великі ісламські громади серед іммігрантів
                    в інших частинах світу, наприклад, у Західній Європі. Близько 20 % мусульман живуть у країнах
                    арабського світу.
                </h6>
                <h6>
                    Карта поширення ісламу за країнами. Зелений колір — суніти, синій — шиїти.
                    Майже всі мусульмани належать до однієї з двох головних течій, Сунізму або Шиїзму. Сьогодні у світі
                    приблизно 85 % сунітів і 15 % — шиїтів.
                </h6>
            </div>
            <div className={"contentImages"}>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Allah_logo.svg/200px-Allah_logo.svg.png"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Dcp7323-Edirne-Eski_Camii_Allah-ds.svg/170px-Dcp7323-Edirne-Eski_Camii_Allah-ds.svg.png"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/FirstSurahKoran.jpg/220px-FirstSurahKoran.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Al_Shahada.jpg/220px-Al_Shahada.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Cheshm_manuscript.jpg/220px-Cheshm_manuscript.jpg"}/>
                <img
                    src={"https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Kaaba_111.jpg/219px-Kaaba_111.jpg"}/>
            </div>
        </div>
    );
};

export default Islam;